Revit 2027 API
Group.AttachedParentId Property
 Indicates the Id of the parent group this group is attached to.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AttachedParentId { get; }
Public ReadOnly Property AttachedParentId As ElementId
	Get
public:
property ElementId^ AttachedParentId {
	ElementId^ get ();
}
member AttachedParentId : ElementId with get
Property Value
ElementId
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace